{
	"_comment": {
		"type": "Allowed values: wondrous, weapon, armor, tool, ammunition, vehicle, other",
		"rarity": "Allowed values: common, uncommon, rare, very rare, legendary, artifact",
		"reqAttune": "Use 'no' or 'yes (SPECIFICATION)'"
	},
	"item": [
		{
			"name": "#First Item Name",
			"meno": "",
			"source": "ALP",
			"page": "0",
			"rarity": "varies",
			"reqAttune": "no",
			"type": "wondrous",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis": "0",
					"int": "0",
					"cha": "0"
				},
				"savingThrow": "0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Line_1",
				"Line_2",
				"Line_3",
				"Line_4"
			]
		},
		{
			"name": "Weapon Oils",
			"meno": "Oleje na zbrane",
			"source": "ALP",
			"page": "0",
			"rarity": "varies",
			"reqAttune": "no",
			"type": "wondrous",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis": "0",
					"int": "0",
					"cha": "0"
				},
				"savingThrow": "0"
			},
			"spellFocus": "no",
			"properties": [
				"consumable"
			],
			"tags": [],
			"entries": [
				"Weapon Oils are alchemical concoctions designed by monster hunters to imbue their weapons with specific types of damage. These oils replace the weapon’s normal damage type with a different one upon application.",
				"Each oil belongs to one of five tiers of rarity and provides a distinct elemental, magical, or supernatural damage type:<ul><li>- <b>Basic (Common) Oils</b> [Fire, Cold]</li><li>- <b>Searing (Uncommon) Oils</b> [Poison, Acid]</li><li>- <b>Storm (Rare) Oils</b> [Lightning, Thunder]</li><li>- <b>Exalted (Very Rare) Oils</b> [Radiant, Necrotic]</li><li>- <b>Invisible (Legendary) Oils</b> [Force, Psychic]</li></ul>",
				"<b>Additionally, Weapon Oils are classified by potency:</b><ul><li>- <b>Minimus:</b> The weapon deals damage with a die half the size of its original damage die (e.g., 1d12 becomes 1d6, 2d6 becomes 2d3).</li><li>- <b>Medianus:</b> The weapon retains its original damage dice, but the damage type changes.</li><li>- <b>Maximus:</b> The weapon deals damage with double the number of its original damage dice (e.g., 1d12 becomes 2d12, 2d6 becomes 4d6).</li></ul>",
				"<b>Application and Activation:</b> Applying an oil to a weapon takes 5 minutes. Once applied, the oil remains on the weapon for 5 hours, but its magical effect must be activated. Activating an oil is a free action, and once activated, it lasts for 10 minutes. If deactivated before the duration ends, the oil is expended and cannot be reused.",
				"<b>Special Properties:</b> A weapon enhanced with an oil loses its original damage type unless it has the Flowing property. Only one oil can be applied to a weapon at a time. These oils are rare and typically reserved for experienced hunters.",
				"<b>Example Conversions:</b>",
				"- A Greataxe (1d12 Slashing) with Basic Fire Minimus deals 1d6 Fire damage.",
				"- A Greataxe with Basic Fire Medianus deals 1d12 Fire damage.",
				"- A Greataxe with Basic Fire Maximus deals 2d12 Fire damage.",
				"- A Maul (2d6 Bludgeoning) with Storm Lightning Minimus deals 2d3 Lightning damage.",
				"- A Maul with Storm Lightning Medianus deals 2d6 Lightning damage.",
				"- A Maul with Storm Lightning Maximus deals 4d6 Lightning damage.",
				"Weapon Oils provide hunters with a means to overcome creatures resistant or immune to conventional attacks, ensuring they are always prepared for the hunt."
			]
		},
		{
			"name": "#Dark Ice Huhammer",
			"meno": "HuHammer temného ľadu",
			"source": "ALP",
			"page": "0",
			"rarity": "Legendary",
			"reqAttune": "yes",
			"type": "weapon",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis": "0",
					"int": "0",
					"cha": "0"
				},
				"savingThrow": "0"
			},
			"spellFocus": "no",
			"properties": [
				"Axria weapon",
				"melee weapon",
				"28 lb.",
				"Hulking",
				"two-handed",
				"special"
			],
			"tags": ["attunement by creature with cold resistnace or cold immunity"],
			"entries": [
				"3d6 bludgeoning + 2d8 cold",
				"<b>Special Traits</b>",
				"This weapon grants the access to all traits to any wielder, even without attunement.",
				"<b>Glacial Slam</b>",
				"When you use the HuHammer's special property to knock an enemy prone, the intense impact sends out a shockwave of frost: All creatures within a 10-foot cone behind the target must make a DC 16 Dexterity saving throw or take 2d6 cold damage and have their speed reduced by 15 feet until the end of their next turn.",
				"<b>Frostborn Momentum</b>",
				"Each time you hit with the HuHammer, its chilling power builds:<br>On a hit, the target must make a DC 15 Constitution saving throw or suffer Frostbite until the end of its next turn. While <i>Frostbitten:</i><br>- The target has disadvantage on Strength and Dexterity saving throws.<br>- The target's speed is halved.<br>If you crit, Frostbite applies automatically, and the target's speed is reduced to 0 until the end of its next turn.",
				"<b>Shatter Terrain</b>",
				"When you use the HuHammer to strike the ground as an action, you can freeze and shatter a 15-foot radius area:<br>All creatures within the area must succeed on a DC 16 Dexterity saving throw or fall prone and take 3d8 cold damage.<br>The terrain in this area becomes frozen and counts as difficult terrain for 1 minute. Non-magical objects within the area become brittle and can be shattered. (Whenever the object is hit, the hit is a Critical Hit.)",
				"<b>Passive Freezing</b>",
				"When left unattended, the HuHammer exerts its icy influence:<br>Within 1 minute, it freezes a 30-foot radius of water, turning it into solid ice.<br>Within 1 hour, it freezes a 30-foot radius area of terrain, creating slippery, difficult terrain.<br>Creatures in 15-feet radius will receive condition Frostbitten after an 1 hour, unless the weapon is in special container or the creature is attuned to the weapon or creature is immune to the cold damage.",
				"<b>Cold Recoil</b>",
				"If the wielder is not attuned to the HuHammer, they take 3d10 cold damage at the start of each turn while holding it and must succeed on a DC 17 Constitution saving throw or be restrained in ice until the end of their next turn. If reduced to 0 HP while holding the weapon, they are petrified in ice until thawed."
			]
		},
		{
			"name": "#Shadow Fire Chakram",
			"meno": "Chakram Tieňového Plameňa",
			"source": "ALP",
			"page": "0",
			"rarity": "Legendary",
			"reqAttune": "yes",
			"type": "weapon",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis":"0",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": [
				"Axria weapon",
				"melee weapon",
				"2 lb.",
				"Exquisite",
				"light",
				"thrown (60/150)",
				"special"
			],
			"tags": ["attunement by creature with fire resistnace or fire immunity"],
			"entries": [
				"1d6 bludgeoning + 2d6 fire",
				"<b>Special Traits</b>",
				"This weapon grants the access to all traits to any wielder, even without attunement.",
				"<b>Blazing fire</b>",
				"When you use the Chakram's special property to hit multiple targets the heat will build up in moment and every target beyond the first will receive extra 1d6 fire damage.",
				"<b>Overheating</b>",
				"Each time you hit with the Chakram, its heating power leaves a mark:<br>On a hit, the target must make a DC 15 Constitution saving throw or suffer Overheating until the end of its next turn. While <i>Overheating:</i><br>- The target has disadvantage on Strength and Intelligence saving throws.<br>- The target's can not take reactions.<br>If you crit, Overheating applies automatically, and the target's takes 1d6 fire damage on the start of its next turn.",
				"<b>Power of the Forge</b>",
				"When you use the Chakram to strike the metal object as an action, you can melt it and shatter a 15-foot radius area:<br>- If its an armor, you will reduce its AC by 3 and it will also deal 2d8 fire damage to any creature wearing the armor for the next 1d4 turns.<br>- If its a weapon, you will reduce its durability by 2 and it will also 2d8 fire damage to any creature holding it for the next 1d4 turns.<br>- If its other metal object, you will reduce its properties and make it tar-like for 1 minute. (Whenever the object is hit, the hit is a Critical Hit.)<br>If the object is of magical nature you must pass Arcana check to affect the metal object. DC is given by DM. On fail the object will only deal the fire damage but its properties will not be affected.<br>Also the Chakram can be used as source of heat for any forge.",
				"<b>Passive Heating</b>",
				"When left unattended, the Chakram exerts its fiery influence:<br>Within 1 minute, it boils a 15-foot radius of water, turning it into steam.<br>Within 1 hour, it heats a 15-foot radius area of terrain, creating slippery, difficult terrain.<br>If Chakram will touch with any flammable object it will ignites instantly.<br>Creatures in 10-feet radius will receive condition Overheated after an 1 hour, unless the weapon is in special container or the creature is attuned to the weapon or creature is immune to the fire damage.",
				"<b>Fire Recoil</b>",
				"If the wielder is not attuned to the Chakram, they take 3d8 Fire damage at the start of each turn while holding it and must succeed on a DC 17 Constitution saving throw or be restrained in ice until the end of their next turn. If reduced to 0 HP while holding the weapon, they are reduced to ash."
			]
			},
			{
				"name": "Spiked Armor",
				"meno": "ÚtokOchrany",
				"source": "ALP",
				"page":"0",
				"rarity": "rare",
				"reqAttune": "no",
				"type": "armor",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["medium", "heavy"],
				"tags": [],
				"entries": [
					"Hunters known as \"Hedgehog Hunters\" or \"Porcupine Stalkers\" favor this armor, which is covered in sharp, sturdy spikes. While wearing this armor, whenever a creature within 5 feet of you hits you with a melee attack, it must make a Dexterity saving throw (DC = 8 + your proficiency bonus + your Strength modifier + academy level). On a failed save, the attacker takes piercing damage equal to your academy level in d6s (e.g., at academy level 3 (bojon), the damage is 3d6).",
					"This damage is always piercing. However, some hunters coat the armor in weapon oils to change the damage type. Applying an oil to this armor takes twice as long as applying it to a weapon.",
					"Additionally, only clumsy or reckless creatures suffer from the armor’s spikes—creatures with high agility can avoid them. A creature that has the Evasion feature or advantage on Dexterity saving throws against effects it can see automatically succeeds on this saving throw."
				]
			},
			{
				"name": "Noble Masochist",
				"meno": "DokonalýOchranca",
				"source": "ALP",
				"page":"0",
				"rarity": "very rare",
				"reqAttune": "yes",
				"type": "armor",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["heavy"],
				"tags": [],
				"entries": [
					"This enchanted armor is favored by those who would sacrifice themselves to protect others. While wearing this armor, you can use a bonus action or a reaction to form a protective bond with a creature within 50 feet of you. While bonded, any damage that the bonded creature would take is instead transferred to you. This bond lasts until you end it as a bonus action, the bonded creature moves more than 50 feet away from you, or you become unconscious.",
					"You gain temporary hit points equal to your academy level * your constitution bonus when forming the bond.",
					"Damage transferred in this way bypasses any resistances or immunities you have. If the damage would reduce you to 0 hit points, the bond ends, but the excess damage is still taken by you." 
				]
			},
			{
				"name": "Reductor",
				"meno": "Reduktor",
				"source": "ALP",
				"page":"0",
				"rarity": "varies",
				"reqAttune": "no",
				"type": "armor",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["light", "medium"],
				"tags": [],
				"entries": [
					"Crafted primarily from the hides of powerful creatures, this armor retains traces of their natural resistances. While it does not grant full immunity to damage types, it reduces their effects.",
					"<b>Rare</b>: Grants resistance to one damage type.<br><b>Very Rare:</b> Grants resistance to two damage types.<br><b>Legendary:</b> Grants resistance to three damage types.",
					"The damage types are determined when the armor is created and cannot be changed."
				]
			},
			{
				"name": "Swift-Healing Bandages",
				"meno": "Obväzy Rýchlo Liečby",
				"source": "ALP",
				"page":"0",
				"rarity": "uncommon",
				"reqAttune": "no",
				"type": "wondrous",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["consumable"],
				"tags": [],
				"entries": [
					"These enchanted bandages accelerate the body's natural healing process, providing an alternative to resting. Using a set of bandages requires an action, and when applied, they allow a creature to regain hit points as if they had completed a Short Rest, including the ability to spend Hit Dice for healing.",
					"Each set of bandages can be used three times before becoming ineffective. If a creature exhausts its hit dices, it cannot regain additional hit points through normal Short Rest healing unless it completes a Long Rest or restore the hit dices by other means."
				]
			},
			{
				"name": "Last Aid Brooch",
				"meno": "Posledná pomoc",
				"source": "ALP",
				"page":"0",
				"rarity": "very rare",
				"reqAttune": "no",
				"type": "wondrous",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["consumable"],
				"tags": [],
				"entries": [
					"When all hope is lost and a hunter falls, this magical brooch—shaped like a small spider—offers one final chance at survival. If a creature wearing this brooch dies, another creature can use an action to activate it within 1 hour of the wearer’s death.",
					"Upon activation, the brooch unfolds into a spectral spider that weaves a cocoon of enchanted webbing around the fallen creature. Over the next 1d3 + 1 days, the cocoon slowly restores the body, healing wounds and repairing damage. When the process is complete, the cocoon crumbles away, and the creature emerges fully restored to life, as if finishing long rest. However, the revived creature suffers two levels of exhaustion due to the strain of regeneration.",
					"Once used, the brooch crumbles into dust and is destroyed."
				]
			},
			{
				"name": "Healing and Health Potions",
				"meno": "",
				"source": "ALP",
				"page":"0",
				"rarity": "varies",
				"reqAttune": "no",
				"type": "wondrous",
				"bonuses": {
					"spellAttack":"0",
					"spellSaveDc":"0",
					"weaponAttack":"0",
					"abilityScores": {
						"str":"0",
						"dex":"0",
						"con":"0",
						"wis":"0",
						"int":"0",
						"cha":"0"
					},
					"savingThrow":"0"
				},
				"spellFocus": "no",
				"properties": ["consumable"],
				"tags": [],
				"entries": [
					"These magical potions are designed to restore vitality and cure ailments. A creature can drink a potion as a bonus action, rapidly benefiting from its effects. However, administering a potion to another creature within 5 feet requires an action as it takes more time and care.",
					"Once used, the brooch crumbles into dust and is destroyed.",
					"<b>Elixir of Health</b> (rare) - This potent elixir purges afflictions from the body. When you drink this potion, it:<br> - Cures any disease affecting you.<br> - Removes the blinded, deafened, paralyzed, and poisoned conditions.",
					"<b>Potions of Healing</b> - These potions restore hit points when consumed. Their strength varies by rarity:<br> - <b>Potion of Healing (Common):</b> Restores 2d4 + 2 hit points.<br> - <b>Greater Healing Potion (Uncommon):</b> Restores 4d4 + 4 hit points.<br> - <b>Superior Healing Potion (Rare):</b> Restores 8d4 + 8 hit points.<br> - <b>Supreme Healing Potion (Very Rare):</b> Restores 10d4 + 20 hit points.<br> - <b>Mythic Healing Potion (Legendary):</b> Restores all missing hit points.",
					"<b>⇊ ⇊ CAREFULL ⇊ ⇊</b>",
					"<b>Potion of Poison (uncommon)</b> - This concoction looks, smells, and tastes like a potion of healing or other beneficial potion. However, it is actually poison masked by illusion magic. An identify spell reveals its true nature.",
					"If you drink it, you take 3d6 poison damage, and you must succeed on a DC 13 Constitution saving throw or be poisoned. At the start of each of your turns while you are poisoned in this way, you take 3d6 poison damage. At the end of each of your turns, you can repeat the saving throw. On a successful save, the poison damage you take on your subsequent turns decreases by 1d6. The poison ends when the damage decreases to 0."
				]
			},
		{
			"name": "Arcane Biscuit",
			"meno": "Obnomág",
			"source": "ALP",
			"page":"0",
			"rarity": "very rare",
			"reqAttune": "no",
			"type": "wondrous",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str":"0",
					"dex":"0",
					"con":"0",
					"wis":"0",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": ["consumable"],
			"tags": [],
			"entries": [
				"Not all hunters rely on weapons—some wield magic, but even the most skilled spellcasters can find themselves drained at a crucial moment. When a monster is closing in and no spells remain, a desperate mage may turn to the Arcane biscuit—a notoriously foul-tasting ration that restores magical power at a cost.",
				"When you eat a Arcane biscuit as an action, you regain one expended spell slot for each spell level you can cast, up to 6th level. This does not restore 7th, 8th, or 9th-level spell slots, as the biscuit is not potent enough to replenish such immense power.",
				"However, the sudden surge of magic strains the body. Upon consuming a Arcane biscuit, you immediately gain one level of exhaustion. If you already have exhaustion levels, consuming another biscuit exacerbates the toll, making further spellcasting even more dangerous.",
				"Many experienced mages learn the secrets of the Arcane biscuit, refining its formula to reduce its drawbacks—but for most, the risk is often necessary to survive." 
			]
		},
		{
			"name": "Weapon of Power",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "weapon",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str": "+2",
					"dex":"0",
					"con":"0",
					"wis":"0",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Strength score increases by 2 but can't exceed 20",
				"This item variant can be applied to the following base items: Simple Melee Weapon,Simple Range Weapon, Martial Melee Weapon, Martial Range Weapon, Acria Melee Weapon, Axria Range Weapon"
			]
		},
		{
			"name": "Weapon of Agility",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "weapon",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str": "0",
					"dex": "+2",
					"con":"0",
					"wis":"0",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Dexterity score increases by 2 but can't exceed 20",
				"This item variant can be applied to the following base items: Simple Melee Weapon,Simple Range Weapon, Martial Melee Weapon, Martial Range Weapon, Acria Melee Weapon, Axria Range Weapon"
			]
		},
		{
			"name": "Shield of Endurance",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "armor",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "+2",
					"wis":"0",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Constitution score increases by 2 but can't exceed 20",
				"This item variant can be applied to the following base items: Buckler Shield, Classic Shield, Tower Shield"
			]
		},
		{
			"name": "Staff of Instinct",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "wondrous",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con":"0",
					"wis": "+2",
					"int":"0",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "yes",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Wisdom score increases by 2 but can't exceed 20"
			]
		},
		{
			"name": "Wand of Knowledge",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "wondrous",
			"bonuses": {
				"spellAttack":"0",
				"spellSaveDc":"0",
				"weaponAttack":"0",
				"abilityScores": {
					"str": "0",
					"dex":"0",
					"con":"0",
					"wis":"0",
					"int": "+2",
					"cha":"0"
				},
				"savingThrow":"0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Intelligence score increases by 2 but can't exceed 20"
			]
		},
		{
			"name": "Gem of Impression",
			"meno": "",
"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "wondrous",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis": "0",
					"int": "0",
					"cha": "+2"
				},
				"savingThrow": "0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Your Charisma score increases by 2 but can't exceed 20"]
			},
			{
				"name": "Quickmagic Coin",
				"meno": "RýchloMágia",
"source": "ALP",
				"page":"0",
				"rarity": "varies",
				"reqAttune": "no",
				"type": "wondrous",
				"bonuses": {
					"spellAttack": "0",
					"spellSaveDc": "0",
					"weaponAttack": "0",
					"abilityScores": {
						"str": "0",
						"dex": "0",
						"con": "0",
						"wis": "0",
						"int": "0",
						"cha": "0"
					},
					"savingThrow": "0"
				},
				"spellFocus": "no",
				"properties": [],
				"tags": [],
				"entries": [
					"Not all hunters have the luxury of a mage in their ranks, and magical scrolls remain useless to those untrained in the arcane arts. Quickmagic Coins offer a different solution—single-use magic imbued within a small enchanted token, requiring no prior magical knowledge to activate.",
					"Each Quickmagic Coin contains a single spell, represented by intricate patterns engraved on its surface. Some symbols may be misleading or unclear, but the Identify spell can always reveal the spell within.",
					"<b>Using a Quickmagic Coin</b>",
					"Anyone, even those without magical ability, can activate a Quickmagic Coin by pressing it against a magic-sensitive vein (such as the wrist or temple). The coin is absorbed into the user, and the spell is immediately cast. If the spell requires an attack roll or saving throw, its effectiveness depends on the user's mental attributes.",
					"<b>Determining Spellcasting Ability</b>",
					"The effectiveness of a Quickmagic Coin depends on the spell’s school, which dictates which mental ability modifies its power:", 
					"<i><b>Intelligence:</b><br>Evocation, Abjuration, Transmutation, Divination<i>",
					"<i><b>Wisdom:</b><br>Conjuration, Necromancy<i>",
					"<i><b>Charisma:</b><br>Enchantment, Illusion<i>",
					"<b>Spellcasting Attributes</b>",
					"<i><b>Quickmagic Saved DC:</b><br>6 + proficiency bonus + spell ability modifier<i>",
					"<i><b>Quickmagic Attack Bonus:</b><br>proficiency bonus + spell ability modifier - 2<i>",
					"Since these coins require no training to use, they have become highly sought-after items—even appearing frequently on the black market, where untrained individuals can wield dangerous magic without restriction."
				]
			},
			{
				"name": "Self-Squire",
				"meno": "SamoPanoš",
"source": "ALP",
				"page":"0",
				"rarity": "rare",
				"reqAttune": "yes",
				"type": "wondrous",
				"bonuses": {
					"spellAttack": "0",
					"spellSaveDc": "0",
					"weaponAttack": "0",
					"abilityScores": {
						"str": "0",
						"dex": "0",
						"con": "0",
						"wis": "0",
						"int": "0",
						"cha": "0"
					},
					"savingThrow": "0"
				},
				"spellFocus": "no",
				"properties": [],
				"tags": [],
				"entries": [
					"During battle, a hunter may need to swap weapons quickly—yet not all weapons can be conveniently carried on a belt or back. To solve this problem, the Self-Squire was created, a magical assistant that hovers near its wielder and manages their armaments.",
					"<b>Functionality</b>",
					"When activated as a bonus action, the Auto-Squire levitates within 5 feet of its attuned user, similar to the Quill-Scribe or Tome-Glide. While active, it can:",
					" - <b>Hold up to three weapons</b> - additionaly it can also carry one shield",
					" - <b>Retrieve dropped weapons</b> - it can lift one weapon per round from the ground",
					" - <b>Swap weapons</b> - as a free action user can drop current weapon and pick new one, provided Self-Squire is within reach.",
					"<b>Limitations</b>",
					"The Auto-Squire does not wield weapons, attack, or block. It simply carries and retrieves them.",
					"If struck by an area effect (such as Fireball), it makes a Dexterity saving throw using the attuned user’s Dexterity modifier + proficiency bonus. On failure, it drops all carried weapons.",
					"This magical assistant ensures that a hunter is never caught unarmed, even in the heat of battle."
				]
			},
			{
				"name": "LongSpeak 2.0",
				"meno": "DiaľkoReč 2.0",
				"source": "ALP",
				"page":"0",
				"rarity": "rare",
				"reqAttune": "no",
				"type": "wondrous",
				"bonuses": {
					"spellAttack": "0",
					"spellSaveDc": "0",
					"weaponAttack": "0",
					"abilityScores": {
						"str": "0",
						"dex": "0",
						"con": "0",
						"wis": "0",
						"int": "0",
						"cha": "0"
					},
					"savingThrow": "0"
				},
				"spellFocus": "no",
				"properties": [],
				"tags": [],
				"entries": [
					"Long-distance communication is vital for hunters. Cities rely on it for up-to-date reports from the wilds, while hunters need to stay informed about the state of civilization. Traditional magic alone is insufficient to connect every hunter, leading to the development of LongSpeak, a techno-magical device that enables instant communication over great distances.",
					"<b>Functionality</b>",
					"The LongSpeak 2.0 is a small pouch-like device with metal components. As an action, the user can establish a connection with another LongSpeak within range.<br> - <b>Relay Tower Network:</b> The LongSpeak 2.0 functions only within the coverage area of magical relay towers, which each have a range of 400 miles. These towers can connect with each other, extending communication range indefinitely as long as a chain of towers exists between users.<br> - <b>Direct Pairing (Legacy Mode):</b> If outside tower coverage, the LongSpeak 2.0 cannot establish a direct link. However, the older LongSpeak 1.0—a bulkier backpack-sized model—can still operate without towers by linking directly with another LongSpeak 1.0 or LongSpeak 2.0 within 40 miles.<br> - <b>Legacy Tower Link:</b> The LongSpeak 1.0 can also connect to magical relay towers, and like the towers themselves, LongSpeak 1.0 units can link together to extend their range, creating a relay chain. In fact, this direct-link system was the blueprint for how the relay towers were eventually designed.",
					"Though LongSpeak 2.0 is far more convenient, hunters traveling deep into the wilderness may still carry a LongSpeak 1.0 as a backup—despite its impractical size—when tower coverage is uncertain."
				]
			},
			{
			"name": "Quill-Scribe & Tome-Glide",
			"meno": "Peropíš a Kniholet",
			"source": "ALP",
			"page":"0",
			"rarity": "uncommon",
			"reqAttune": "yes",
			"type": "wondrous",
			"bonuses": {
				"spellAttack": "0",
				"spellSaveDc": "0",
				"weaponAttack": "0",
				"abilityScores": {
					"str": "0",
					"dex": "0",
					"con": "0",
					"wis": "0",
					"int": "0",
					"cha": "0"
				},
				"savingThrow": "0"
			},
			"spellFocus": "no",
			"properties": [],
			"tags": [],
			"entries": [
				"Hunters, especially Scholars, often need to take notes even in the midst of dangerous expeditions. To ensure no crucial thought is lost, two magical tools were created: the Quill-Scribe and the Tome-Glide—an enchanted quill and book that assist in recording knowledge without disrupting combat.",
				"<b>Quill-Scribe</b>",
				"This magical quill hovers within 5 feet of its attuned user, automatically writing down anything they dictate in their own handwriting. If the user also writes manually, the quill learns their writing style and can mimic it when scribing independently.",
				"<b>Tome-Glide</b>",
				"This enchanted book follows the attuned user, floating within 5 feet of them. It remains open to a chosen page, allowing the Quill-Scribe to write without needing a surface. The book can also be commanded to turn pages or close itself with a simple verbal command.",
				"<b>Limitations & Spell Usage</b>",
				"The Quill-Scribe cannot be used to copy spells into a spellbook for reduced cost or time—the intricate process of transcribing magic still requires the user's full attention and magical effort.",
				"However, Tome-Glide can function as a wizard’s spellbook, allowing spells to be recorded in it just as they would in any normal spellbook.",
				"Together, these items allow a hunter to take notes even during combat, ensuring that valuable insights are never lost."
			]
		},
		{
		"name": "Magical Glasses of...",
		"meno": "",
		"source": "ALP",
		"page":"0",
		"rarity": "uncommon",
		"reqAttune": "no",
		"type": "wondrous",
		"bonuses": {
			"spellAttack": "0",
			"spellSaveDc": "0",
			"weaponAttack": "0",
			"abilityScores": {
				"str": "0",
				"dex": "0",
				"con": "0",
				"wis": "0",
				"int": "0",
				"cha": "0"
			},
			"savingThrow": "0"
		},
		"spellFocus": "no",
		"properties": [],
		"tags": [],
		"entries": [
			"These finely crafted glasses come in a variety of designs, each imbued with a subtle magical enhancement. While wearing a pair, you gain one of the following benefits, depending on the type of glasses:",
			"<b>Glasses of the Scribe</b> → You can read one additional language of your choice.",
			"<b>Glasses of the Scout</b> → You gain a +1 bonus to Perception checks.",
			"<b>Glasses of the Night</b> → Your darkvision increases by 5 feet.",
			"<b>Glasses of Magic</b> → The range of Detect Magic increases by 10 feet.",
			"<b>Glasses of Arcana</b> → You gain a +5-foot increase to the range at which you can see the aura of magical objects and effects.",
			"<b>Glasses of the Silver Tongue</b> → You gain a +1 bonus to Persuasion checks.",
			"<b>Glasses of the Deceiver</b> → You gain a +1 bonus to Deception checks.",
			"<b>Glasses of the Scholar</b> → You gain a +1 bonus to History checks.",
			"<b>Glasses of the Mystic</b> → You gain a +1 bonus to Arcana checks.",
			"<b>Glasses of the Investigator</b> → You gain a +1 bonus to Investigation checks.",
			"<b>Glasses of the Observer</b> → You gain a +1 bonus to Insight checks.",
			"<b>Glasses of the Masquerade</b> → The DC to see through your Disguise Self spell increases by 1.",
			"<b>Glasses of the Sharpshooter</b> → If a weapon or spell has a range greater than 30 feet, its range increases by 5 feet (e.g., a shortbow’s range changes from 80/320 to 85/325).",
			"Each pair of glasses grants only one effect, and their magic does not stack with other magical items that provide the same benefit."
			]
	},
	{
		"name": "Injecti-nator",
		"meno": "Život žilou",
		"source": "ALP",
		"page": "0",
		"rarity": "rare",
		"reqAttune": "yes",
		"type": "wondrous",
		"bonuses": {
			"spellAttack": "0",
			"spellSaveDc": "0",
			"weaponAttack": "0",
			"abilityScores": {
				"str": "0",
				"dex": "0",
				"con": "0",
				"wis": "0",
				"int": "0",
				"cha": "0"
			},
			"savingThrow": "0"
		},
		"spellFocus": "no",
		"properties": [],
		"tags": [],
		"entries": [
			"This intricate arcane bracer is fitted with a small vial chamber, capable of holding one potion of healing. When a potion is placed inside, the bracer magically refines and pressurizes it, enhancing its effects.",
			"While attuned to this item, you can activate it in one of the following ways:<br>• <b>Adrenaline Surge (Free Action)</b>: You can inject yourself with the stored healing potion as a free action on your turn.<br>• <b>Last-Second Save (Reaction)</b>: If you are reduced to 0 HP but not killed outright, you can use your reaction to inject the potion instead of falling unconscious.",
			"Enhanced Healing:",
			"When consumed through the Auto-Injector, a healing potion dices are rolled with advantage. (Roll every dice twice and pick the higher result) Mythic Healing Potion will instead grant + 20 temporary hit points.",
			"Once used, the bracer must be reloaded with another healing potion as an action. However the bracer will refines and pressurizes the potion only durring the short rest."
		]
	}
]
}
