{
  "classes": [
    {
      "name": "Barbarian",
      "source": "PHB",
      "hit_die": "d12",
      "primary_ability": "Strength",
      "saving_throws": [
        "Strength",
        "Constitution"
      ],
      "level_table": [
        {
          "level": 1,
          "features": [
            "Rage",
            "Unarmored Defense"
          ],
          "rages": 2,
          "rage_damage": "+2"
        },
        {
          "level": 2,
          "features": [
            "Danger Sense",
            "Reckless Attack"
          ],
          "rages": 2,
          "rage_damage": "+2"
        },
        {
          "level": 3,
          "features": [
            "Primal Path",
            "Primal Knowledge"
          ],
          "rages": 3,
          "rage_damage": "+2"
        },
        {
          "level": 4,
          "features": [
            "Ability Score Improvement"
          ],
          "rages": 3,
          "rage_damage": "+2"
        },
        {
          "level": 5,
          "features": [
            "Extra Attack",
            "Fast Movement"
          ],
          "rages": 3,
          "rage_damage": "+2"
        },
        {
          "level": 6,
          "features": [
            "Path Feature"
          ],
          "rages": 4,
          "rage_damage": "+2"
        },
        {
          "level": 7,
          "features": [
            "Feral Instinct",
            "Instinctive Pounce"
          ],
          "rages": 4,
          "rage_damage": "+2"
        },
        {
          "level": 8,
          "features": [
            "Ability Score Improvement"
          ],
          "rages": 4,
          "rage_damage": "+2"
        },
        {
          "level": 9,
          "features": [
            "Brutal Critical (1 die)"
          ],
          "rages": 4,
          "rage_damage": "+3"
        },
        {
          "level": 10,
          "features": [
            "Path Feature"
          ],
          "rages": 4,
          "rage_damage": "+3"
        },
        {
          "level": 11,
          "features": [
            "Relentless Rage"
          ],
          "rages": 4,
          "rage_damage": "+3"
        },
        {
          "level": 12,
          "features": [
            "Ability Score Improvement"
          ],
          "rages": 5,
          "rage_damage": "+3"
        },
        {
          "level": 13,
          "features": [
            "Brutal Critical (2 dice)"
          ],
          "rages": 5,
          "rage_damage": "+3"
        },
        {
          "level": 14,
          "features": [
            "Path Feature"
          ],
          "rages": 5,
          "rage_damage": "+3"
        },
        {
          "level": 15,
          "features": [
            "Persistent Rage"
          ],
          "rages": 5,
          "rage_damage": "+3"
        },
        {
          "level": 16,
          "features": [
            "Ability Score Improvement"
          ],
          "rages": 5,
          "rage_damage": "+4"
        },
        {
          "level": 17,
          "features": [
            "Brutal Critical (3 dice)"
          ],
          "rages": 6,
          "rage_damage": "+4"
        },
        {
          "level": 18,
          "features": [
            "Indomitable Might"
          ],
          "rages": 6,
          "rage_damage": "+4"
        },
        {
          "level": 19,
          "features": [
            "Ability Score Improvement"
          ],
          "rages": 6,
          "rage_damage": "+4"
        },
        {
          "level": 20,
          "features": [
            "Primal Champion"
          ],
          "rages": "Unlimited",
          "rage_damage": "+4"
        }
      ],
      "core_traits": [
        {
          "hit_point_die": "D12 per level",
          "hit_points_level_1": "12 + Con. modifier",
          "hit_points_additional_levels": "D12 + Con. modifier or 7 + Con. modifier",
          "saving_throw_proficiencies": [
            "Strength",
            "Constitution"
          ],
          "skill_proficiencies": {
            "choose": 2,
            "options": [
              "Animal Handling",
              "Athletics",
              "Intimidation",
              "Nature",
              "Perception",
              "Survival"
            ]
          },
          "weapon_proficiencies": [
            "Simple",
            "Martial weapons"
          ],
          "armor_training": [
            "Light armor",
            "Medium armor",
            "Shields"
          ]
        }
      ],
      "starting_equipment": [
        {
          "default": [
            "(a) a greataxe or (b) any martial melee weapon",
            "(a) two handaxes or (b) any simple weapon",
            "An explorer's pack",
            "Four javelins"
          ],
          "alternative": "2d4 × 10 gp to buy your own equipment"
        }
      ],
      "multiclassing": [
        {
          "ability_score_minimum": {
            "Strength": 13
          },
          "weapon_proficiencies": [
            "Simple",
            "Martial weapons"
          ],
          "armor_training": [
            "Shields"
          ]
        }
      ],
      "class_features": [
        {
          "level": 1,
          "feature_name": "Rage",
          "feature_detail": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\r\n\r\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\r\n\r\n- You have advantage on Strength checks and Strength saving throws.\r\n- When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.\r\n- You have resistance to bludgeoning, piercing, and slashing damage.\r\nIf you are able to cast spells, you can't cast them or concentrate on them while raging.\r\n\r\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\r\n\r\nOnce you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th."
        },
        {
          "level": 2,
          "feature_name": "Unarmored Defense",
          "feature_detail": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
        },
        {
          "level": 2,
          "feature_name": "Danger Sense",
          "feature_detail": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
        },
        {
          "level": 2,
          "feature_name": "Reckless Attack",
          "feature_detail": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
        },
        {
          "level": 3,
          "feature_name": "Primal Path",
          "feature_detail": "At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
        },
        {
          "level": 3,
          "feature_name": "Primal Knowledge",
          "feature_detail": "When you reach 3rd level and again at 10th level, you gain proficiency in one skill of your choice from the list of skills available to barbarians at 1st level."
        },
        {
          "level": 4,
          "feature_name": "Ability Score Improvement",
          "feature_detail": "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
        },
        {
          "level": 5,
          "feature_name": "Extra Attack",
          "feature_detail": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
        },
        {
          "level": 5,
          "feature_name": "Fast Movement",
          "feature_detail": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
        },
        {
          "level": 6,
          "feature_name": "Path Feature",
          "feature_detail": "At 6th level, you gain a feature from your Primal Path."
        },
        {
          "level": 7,
          "feature_name": "Feral Instinct",
          "feature_detail": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
        },
        {
          "level": 7,
          "feature_name": "Instinctive Pounce",
          "feature_detail": "As part of the bonus action you take to enter your rage, you can move up to half your speed."
        },
        {
          "level": 8,
          "feature_name": "Ability Score Improvement",
          "feature_detail": "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
        },
        {
          "level": 9,
          "feature_name": "Brutal Critical (1 die)",
          "feature_detail": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."
        },
        {
          "level": 10,
          "feature_name": "Path Feature",
          "feature_detail": "At 10th level, you gain a feature from your Primal Path."
        },
        {
          "level": 11,
          "feature_name": "Relentless Rage",
          "feature_detail": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
        },
        {
          "level": 12,
          "feature_name": "Ability Score Improvement",
          "feature_detail": "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
        },
        {
          "level": 13,
          "feature_name": "Brutal Critical (2 dice)",
          "feature_detail": "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack. This increases to three additional dice at 17th level."
        },
        {
          "level": 14,
          "feature_name": "Path Feature",
          "feature_detail": "At 14th level, you gain a feature from your Primal Path."
        },
        {
          "level": 15,
          "feature_name": "Persistent Rage",
          "feature_detail": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
        },
        {
          "level": 16,
          "feature_name": "Ability Score Improvement",
          "feature_detail": "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
        },
        {
          "level": 17,
          "feature_name": "Brutal Critical (3 dice)",
          "feature_detail": "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
        },
        {
          "level": 18,
          "feature_name": "Indomitable Might",
          "feature_detail": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
        },
        {
          "level": 19,
          "feature_name": "Ability Score Improvement",
          "feature_detail": "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
        },
        {
          "level": 20,
          "feature_name": "Primal Champion",
          "feature_detail": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
        }
      ],
      "subclasses": [
        {
          "name": "Path of the Ancestral Guardian",
          "source": "XGE",
          "description": "Some barbarians hail from cultures that revere their ancestors. These tribes teach that the warriors of the past linger in the world as mighty spirits, who can guide and protect the living. When a barbarian who follows this path rages, the barbarian contacts the spirit world and calls on these guardian spirits for aid.\r\n\r\nBarbarians who draw on their ancestral guardians can better fight to protect their tribes and their allies. In order to cement ties to their ancestral guardians, barbarians who follow this path cover themselves in elaborate tattoos that celebrate their ancestors' deeds. These tattoos tell sagas of victories against terrible monsters and other fearsome rivals.",
          "features": [
            {
              "name": "Ancestral Protectors",
              "level": 3,
              "description": "Starting when you choose this path at 3rd level, spectral warriors appear when you enter your rage. While you're raging, the first creature you hit with an attack on your turn becomes the target of the warriors, which hinder its attacks. Until the start of your next turn, that target has disadvantage on any attack roll that isn't against you, and when the target hits a creature other than you with an attack, that creature has resistance to the damage dealt by the attack. The effect on the target ends early if your rage ends."
            },
            {
              "name": "Spirit Shield",
              "level": 3,
              "description": "Beginning at 6th level, the guardian spirits that aid you can provide supernatural protection to those you defend. If you are raging and another creature you can see within 30 feet of you takes damage, you can use your reaction to reduce that damage by 2d6.\r\n\r\nWhen you reach certain levels in this class, you can reduce the damage by more: by 3d6 at 10th level and by 4d6 at 14th level."
            },
            {
              "name": "Consult the Spirits",
              "level": 3,
              "description": "At 10th level, you gain the ability to consult with your ancestral spirits. When you do so, you cast the augury or clairvoyance spell, without using a spell slot or material components. Rather than creating a spherical sensor, this use of clairvoyance invisibly summons one of your ancestral spirits to the chosen location. Wisdom is your spellcasting ability for these spells.\r\n\r\nAfter you cast either spell in this way, you can't use this feature again until you finish a short or long rest."
            },
            {
              "name": "Vengeful Ancestors",
              "level": 3,
              "description": "At 14th level, your ancestral spirits grow powerful enough to retaliate. When you use your Spirit Shield to reduce the damage of an attack, the attacker takes an amount of force damage equal to the damage that your Spirit Shield prevents."
            }
          ]
        },
        {
          "name": "Path of the Battlerager",
          "source": "SCAG",
          "description": "Known as Kuldjargh (literally 'axe idiot') in Dwarvish, battleragers are dwarf followers of the gods of war and take the Path of the Battlerager. They specialize in wearing bulky, spiked armor and throwing themselves into combat, striking with their body itself and giving themselves over to the fury of battle.",
          "features": [
          {
            "name": "Restriction—Dwarves Only",
            "level": 3,
            "description": "Only dwarves can follow the Path of the Battlerager. The battlerager fills a particular niche in dwarven society and culture.\r\n\r\nYour DM can lift this restriction to better suit the campaign. The restriction exists for the Forgotten Realms. It might not apply to your DM's setting or your DM's version of the Realms."
          },
          {
            "name": "Battlerager Armor",
            "level": 3,
            "description": "When you choose this path at 3rd level, you gain the ability to use spiked armor as a weapon.\r\n\r\nWhile you are wearing spiked armor and are raging, you can use a bonus action to make one melee weapon attack with your armor spikes at a target within 5 feet of you. If the attack hits, the spikes deal 1d4 piercing damage. You use your Strength modifier for the attack and damage rolls.\r\n\r\nAdditionally, when you use the Attack action to grapple a creature, the target takes 3 piercing damage if your grapple check succeeds."
          },
          {
            "name": "Reckless Abandon",
            "level": 6,
            "description": "Beginning at 6th level, when you use Reckless Attack while raging, you also gain temporary hit points equal to your Constitution modifier (minimum of 1). They vanish if any of them are left when your rage ends."
          },
          {
            "name": "Battlerager Charge",
            "level": 10,
            "description": "Beginning at 10th level, you can take the Dash action as a bonus action while you are raging."
          },
          {
            "name": "Spiked Retribution",
            "level": 14,
            "description": "Starting at 14th level, when a creature within 5 feet of you hits you with a melee attack, the attacker takes 3 piercing damage if you are raging, aren't incapacitated, and are wearing spiked armor."
          }
        ]
        },
        {
          "name": "Path of the Beast",
          "source": "TCE",
          "description": "Barbarians who walk the Path of the Beast draw their rage from a bestial spark burning within their souls. That beast bursts forth in the throes of rage, physically transforming the barbarian.\r\n\r\nSuch a barbarian might be inhabited by a primal spirit or be descended from shape-shifters. You can choose the origin of your feral might or determine it by rolling on the Origin of the Beast table.\r\n\r\nOrigin of the Beast\r\nd4\tOrigin\r\n1\tOne of your parents is a lycanthrope, and you've inherited some of their curse.\r\n2\tYou are descended from an archdruid and inherited the ability to partially change shape.\r\n3\tA fey spirit gifted you with the ability to adopt different bestial aspects.\r\n4\tAn ancient animal spirit dwells within you, allowing you to walk this path.",
          "features": [
          {
            "name": "FormoftheBeast",
            "level": 3,
            "description": "description"
          }
          ]
        }
      ]
    }
  ]
}
